{
  "status": "ok",
  "code": 200,
  "messages": null,
  "build": "1.0",
  "parameters": {
    "apiKey": "r4qustj7j4uksj543uwefkfu",
    "id": "kendrick_lamar",
    "format": "json",
    "country": "US",
    "language": "English"
  },
  "serverName": "tul1csprcs9.corporate.local",
  "startTime": "2018-10-04T21:02:24Z",
  "endTime": "2018-10-04T21:02:24Z",
  "duration": 238,
  "parentIds": {
    "amgClassicalId": "Q  2365878",
    "amgPopId": "P  2412704",
    "nameId": "MN0002709646"
  },
  "musicBio": {
    "text": "Indisputably the most acclaimed rap artist of his generation, [roviLink=\"MN0002709646\"]Kendrick Lamar[/roviLink] is one of the rare MCs who has achieved critical and commercial success while earning the respect and support of those who inspired him. After several years of development -- he made his recorded debut as a teenager -- [roviLink=\"MN0002709646\"]Lamar[/roviLink] hit an unparalleled stride in the 2010s. [roviLink=\"MW0002421248\"]Good Kid, M.A.A.D City[/roviLink] (2012), the Grammy-winning [roviLink=\"MW0002835159\"]To Pimp a Butterfly[/roviLink] (2015), and the Grammy- and- Pulitzer-winning [roviLink=\"MW0003040142\"]DAMN.[/roviLink] (2017), his three proper major-label albums, have displayed an unmatched mix of inventive wordplay, compelling conceptual narratives, and deft hooks. The screenplay-level detail of [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s writing has been enriched by the combined efforts of his many collaborators, including a diverse selection of producers and instrumentalists, as well as singers and fellow rappers. He has been equally effective as a singles artist, exemplified by [roviLink=\"MW0003040142\"]DAMN.[/roviLink] highlight \"HUMBLE,\" a number one pop hit.\r\nCompton, California native [roviLink=\"MN0002751815\"]Kendrick Lamar Duckworth[/roviLink] grew up immersed in hip-hop culture and surrounded by gang activity. As a youngster, he gradually discovered an aptitude for writing stories, poems, and lyrics, which naturally led to rapping. He made a name for himself as [roviLink=\"MN0002775976\"]K. Dot[/roviLink]. At the age of 16 in 2003, he issued his debut mixtape, [roviLink=\"MW\"]The Hub City Threat: Minor of the Year[/roviLink]. While it merely hinted at the potential of the then teenager, it was impressive enough to catch the attention of [roviLink=\"MN\"]Top Dawg Entertainment[/roviLink] and led to a long-term association with the label that steadily propelled his career. [roviLink=\"MW\"]Training Day[/roviLink], the [roviLink=\"MN0000934172\"]Jay Rock[/roviLink] collaboration [roviLink=\"MW\"]No Sleep 'Til NYC[/roviLink], and [roviLink=\"MW0002530730\"]C4[/roviLink], issued from 2005 through 2009, likewise preceded [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s decision to go by his first and middle names. The last of the three was issued the same year he became part of [roviLink=\"MN0002968503\"]Black Hippy[/roviLink] with fellow [roviLink=\"MN\"]TDE[/roviLink] artists [roviLink=\"MN0002043281\"]Ab-Soul[/roviLink], [roviLink=\"MN0000934172\"]Jay Rock[/roviLink], and [roviLink=\"MN0002634574\"]ScHoolboy Q[/roviLink], a group whose members frequently appeared on one another's mixtapes and albums. \r\nThe first tape credited to [roviLink=\"MN0002709646\"]Kendrick Lamar[/roviLink] was [roviLink=\"MW\"]Overly Dedicated[/roviLink], released in 2010. Also the rapper's first commercial release, it reached enough listeners to enter Billboard's R&B/Hip-Hop Albums chart. His first official album, [roviLink=\"MW0002186545\"]Section.80[/roviLink], arrived the following year, after [muzeItalic]XXL[/muzeItalic] magazine selected him for the 2011 Freshman Class feature, and entered the Billboard 200 at number 113. With deeper conceptual narratives and sharpened melodic hooks, as well as comparative multi-dimensional development from primary producer [roviLink=\"MN0002750056\"]Sounwave[/roviLink], the set acted as a kind of warning flare for [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s mainstream rap dominance. Additionally, by that point, [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s reputation had been strengthened through guest appearances on dozens of tracks, and he had the support of veteran West Coast stars as well. During a 2011 concert, [roviLink=\"MN0000805274\"]Dr. Dre[/roviLink], [roviLink=\"MN0000029086\"]Snoop Dogg[/roviLink], and [roviLink=\"MN0000073749\"]Game[/roviLink] dubbed him \"The New King of the West Coast,\" a notion [roviLink=\"MN0000805274\"]Dre[/roviLink] endorsed more significantly by subsequently signing [roviLink=\"MN0002709646\"]Lamar[/roviLink] to the [roviLink=\"MN\"]Aftermath[/roviLink] label. \r\n[roviLink=\"MW0002421248\"]Good Kid, M.A.A.D City[/roviLink], [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s major-label debut, was released in October 2012 and entered the Billboard 200 at number two. Three of its singles -- \"Swimming Pools (Drank),\" \"Poetic Justice,\" and \"Bitch Don't Kill My Vibe\" -- reached the Top Ten of Billboard's Hot R&B/Hip-Hop chart, with each one enjoying lengthy stays on playlists of urban U.S. radio stations. More significantly, the album showcased [roviLink=\"MN0002709646\"]Lamar[/roviLink] as an exceptional storyteller capable of making compelling concept albums. It led to Grammy nominations in five categories, including Best New Artist, Album of the Year, and Best Rap Album. [roviLink=\"MN0002570457\"]Miguel[/roviLink]'s \"How Many Drinks?\" and [roviLink=\"MN0002772593\"]A$AP Rocky[/roviLink]'s \"Fuckin' Problems,\" two tracks on which [roviLink=\"MN0002709646\"]Lamar[/roviLink] was featured, were nominated as well.  \r\nRather than rest, [roviLink=\"MN0002709646\"]Lamar[/roviLink] remained active during 2013-2014, with touring as well as appearances on tracks by the likes of [roviLink=\"MN0002014409\"]Tame Impala[/roviLink], [roviLink=\"MN0000803699\"]YG[/roviLink], and fellow [roviLink=\"MN\"]Top Dawg[/roviLink] affiliate [roviLink=\"MN0003180568\"]SZA[/roviLink]. The proud single \"i\" was released in September of the latter year and led to [roviLink=\"MN0002709646\"]Lamar[/roviLink]'s first two Grammy wins (Best Rap Performance, Best Rap Song). Early in 2015, he announced that his third album, [roviLink=\"MW0002835159\"]To Pimp a Butterfly[/roviLink], was due that March, with tracks featuring [roviLink=\"MN0000029086\"]Snoop Dogg[/roviLink], [roviLink=\"MN0000057280\"]Bilal[/roviLink], [roviLink=\"MN0002424073\"]Thundercat[/roviLink], and [roviLink=\"MN0000533117\"]George Clinton[/roviLink]. A technical accident caused the digital album to be released eight days early, but it immediately earned rave reviews and topped the Billboard 200 with sales of 325,000 copies within its first week. It made numerous best-of lists at the end of the year, and in early 2016 earned five Grammy Awards, including Best Rap Album. In March, [roviLink=\"MN0002709646\"]Lamar[/roviLink] released [roviLink=\"MW0002926458\"]untitled unmastered.[/roviLink], an eight-track set consisting of demos recorded around the time of [roviLink=\"MW0002835159\"]To Pimp a Butterfly[/roviLink]. Like the previous release, it debuted at number one, and seamlessly synthesized beatmaking and traditional musicianship from the likes of [roviLink=\"MN0002750056\"]Sounwave[/roviLink], [roviLink=\"MN0002366358\"]Terrace Martin[/roviLink], and [roviLink=\"MN0002424073\"]Thundercat[/roviLink]. \r\nLed by \"Humble,\" his first number one pop hit, [roviLink=\"MW0003040142\"]DAMN.[/roviLink] followed in April 2017 and likewise entered the Billboard 200 at the top. Remarkably, all 14 of its songs entered the Hot 100. The album featured contributions from the likes of [roviLink=\"MN0000367188\"]Rihanna[/roviLink] and [roviLink=\"MN0000219203\"]U2[/roviLink], but at this point, the supporting roles were beneficial more for the guest artists than they were for [roviLink=\"MN0002709646\"]Lamar[/roviLink], whose artistic complexity and versatility were unrivaled. Certified double-platinum within three months of release, the album was released in a deluxe edition near the end of the year, and led to another five Grammy wins, including a second Best Rap Album nod. [roviLink=\"MN0002709646\"]Lamar[/roviLink] was involved with every track contained on yet another number one hit, [roviLink=\"MW0003141415\"]Black Panther: The Album[/roviLink], released in early 2018. That April, [roviLink=\"MW0003040142\"]DAMN.[/roviLink] won the Pulitzer Prize for Music, the first time the judges recognized a work outside the genres of classical and jazz. ~ Andy Kellman",
    "author": "Andy Kellman",
    "musicBioOverview": [
      {
        "overview": "Platinum-selling, Grammy-nominated rapper Kendrick Lamar is one of the rare artists who has achieved critical and commercial success while earning the respect and support of those who inspired him. A native of Compton, California, Lamar originally rapped as K. Dot and released a series of mixtapes under that name. His first official album, [roviLink=\"MW0002186545\"]Section.80[/roviLink] (2011), was released as a digital download and entered the Billboard 200 at number 113. Dubbed \"The New King of the West Coast,\" Lamar signed to Dr. Dre's Aftermath label, where he developed into an exceptional storyteller with the compelling, expansive, and uncompromising albums [roviLink=\"MW0002421248\"]Good Kid, M.A.A.D. City[/roviLink] (2012) and [roviLink=\"MW0002835159\"]To Pimp a Butterfly[/roviLink] (2015). ~ Andy Kellman",
        "author": "Andy Kellman",
        "language": "English"
      }
    ]
  }
}